{
    "experiencesTitle": "My Experiences",
    "internship1": {
      "title": "Full-stack web internship",
      "company": "Supplyzpro",
      "date": "Jul 2024 - Sep 2024",
      "description": "During my internship, I solved problems related to graphs and tables, optimized access rights, and made interface adjustments to improve functionality and aesthetics of the applications. I made significant visual and functional improvements using React.js, Node.js, TypeScript, SCSS, and GitLab."
    },
    "internship2": {
      "title": "Full-stack web internship",
      "company": "SQLI services",
      "date": "Jul 2023 - Sep 2023",
      "description": "Development of a fishing marketplace, Blockchain Mare Nostrum, using React.js, symphony and SCSS. I tested APIs and identified issues, provided statistics to sellers and buyers, and optimized dashboards."
    },
    "internship3": {
      "title": "FULLSTACK WEB/AI CHATBOT INTERNSHIP",
      "company": "LINSOFT",
      "date": "Feb 2025 - May 2025",
      "description": "During my internship, I contributed to the development of an intelligent role-based stock management web application, integrating an OCR system, AI chatbot, and Power BI dashboard. Employees can rent products, while administrators manage users, suppliers, products, roles and purchases via a comprehensive interface. The backend architecture relies on five microservices: authentication and product management (Quarkus + JWT), chatbot (FastAPI), visualization (Python + Power BI) and notifications (Node.js). The interface also enables analysis."
    },
    "internship4": {
      "title": "FREELANCE",
      "company": "Independent Work",
      "date": "Oct 2021 - Dec 2024",
      "description": "I worked on paid web and mobile projects for clients, including custom solutions for students and small businesses. I used the MERN stack (MongoDB, Express, React, Node.js) for web projects, as well as Java, XML, Android Studio and Firebase for a mobile project."
    }
  ,
    "tools": {
      "react": "React.js",
      "node": "Node.js",
      "typescript": "TypeScript",
      "scss": "SCSS",
      "gitlab": "GitLab",
      "trello": "Trello",
      "symfony": "Symfony",
      "css": "CSS"
    },
    "projTitle": "My proudest and latest projects!",
    "chatApp": {
      "title": "Chat application",
      "description": "Developed a real-time chat application where users can quickly create an account, generate a room with a unique code, and chat with multiple participants. Focused on user-friendly design, easy setup, and smooth messaging experience.",
      "tags": ["MERN", "Socket.io", "SCSS"],
      "checkCode": "Check the code"
    },
    "bookingApp": {
      "title": "Student booking App",
      "description": "Developed a student booking app that shows real-time data (apartments) from '9annas.tn' by scraping them and showing them on my website while also showing their location on the map.",
      "tags": ["MERN", "Puppeteer", "Google Map API", "SCSS"],
      "checkCode": "Check the code"
    },
    "ecommerceClone": {
      "title": "E-commerce website clone",
      "description": "Recreated the MODECO.tn website, but better! Focusing on delivering a responsive and user-friendly interface, ensuring optimal performance across devices while maintaining a clean and modern design.",
      "tags": ["HTML", "JavaScript", "CSS", "Bootstrap", "PHP"],
      "checkCode": "Check the code"
    },
    "weatherApp": {
      "title": "Weather App",
      "description": "Developed a Weather App using React.js and CSS, featuring dynamic icon and icon color changes based on the weather temperature. Focused on providing a clean and responsive design with real-time weather updates.",
      "tags": ["React.js", "CSS", "Weather API"],
      "checkCode": "Check the code"
    },
    "absenceManager": {
      "title": "Absence Manager",
      "description": "Created a student booking application with Android Studio (Java/XML) and Firebase. It uses Firestore and real-time database to manage teacher absences. The administrator can verify users, modify them, and view a detailed chart with all information.",
      "tags": ["Android Studio", "Java", "XML", "Firebase", "Firestore"],
      "checkCode": "Check the code"
    },
    "marketplace": {
      "title": "Marketplace",
      "description": "Developed a complete marketplace website allowing users to buy, sell and manage their wishlists. Implemented registration, login, secure payment features and an intuitive interface that contains graphic charts to explain sales and purchases.",
      "tags": ["React.js", "Firebase", "SCSS", "Bootstrap", "Power BI", "EmailJS"],
      "checkCode": "Check the code"
    },
    "smartStockApp": {
      "title": "SMART Stock Management Web App with OCR and Intelligent Chatbot",
      "description": "Developed an intelligent role-based stock management web application, integrating an OCR system, AI chatbot, and Power BI dashboard. Employees can rent products, while administrators manage users, suppliers, products, roles and purchases via a comprehensive interface. The backend architecture relies on five microservices: authentication and product management (Quarkus + JWT), chatbot (FastAPI), visualization (Python + Power BI) and notifications (Node.js). The interface also enables automated invoice analysis via camera or image.",
      "tags": ["Quarkus", "JWT", "FastAPI", "Python", "Power BI", "Node.js", "OCR", "AI Chatbot"],
      "checkCode": "Check the code"
    },
    "gymWebsite": {
      "title": "GYM Website",
      "description": "Gym website where you can sign in and get your gym membership online. The website is made from HTML/CSS/JavaScript/PHP/MySQL. It's a simple fullstack website for gyms where the user will have the ability to get advices for bodybuilding/fitness and have the capability to sign up and chose one of 2 kind of memberships.",
      "tags": ["HTML", "CSS", "JavaScript", "PHP", "MySQL"],
      "checkCode": "Check the code"
    },
    "movieRatingWebsite": {
      "title": "Movie Rating Website - Tunibest",
      "description": "Tunibest is a movie rating website like IMDB made from HTML/CSS/JavaScript/PHP where users can rate their favourite movies. A simple and intuitive platform to discover and rate movies.",
      "tags": ["HTML", "CSS", "JavaScript", "PHP"],
      "checkCode": "Check the code"
    },
    "contact": {
      "text": "I am always open to discuss new opportunities. Reach out if you'd like to collaborate on a project or simply say hi!",
      "formHead": "Contact Me!",
      "namePlaceholder": "Name",
      "emailPlaceholder": "Email",
      "phonePlaceholder": "Phone number",
      "contentPlaceholder": "Content",
      "submitButton": "Submit"
    },
    "profile": {
      "name": "Belhiba Tarak",
      "description": "A passionate software developer specializing in web, mobile and AI development and interested in big data and cloud.",
      "downloadResume": "Download My Resume",
      "contactMe": "Contact Me"
    },
    "navbar": {
      "about": "About",
      "experience": "Experience",
      "projects": "Projects",
      "skills": "Skills",
      "contact": "Contact"
    },
    "skillsTitle": "My Skills",
    "skillsSubtitle": "Technologies and tools I work with"
  }
  